{
  "welcome_to_react": "Bienvenue a React et react-i18next",
  "dev": "développeur front end",
  "intro": "intro",
  "about": "à propos",
  "projects": "projets",
  "skills": "compétences",
  "contact": "contact",
  "me": "moi",
  "about_text": "Je suis un développeur de 23 ans qui se forme depuis plus d’un an au front end development. Aujourd’hui je maitrise et j’ai une bonne expérience des bases du front end (HTML, CSS et JavaScript) et de React. Actuellement je code principalement en utilisant React, Redux et Styled Components. J’ai aussi quelques base de back end avec NodeJS. Aujourd'hui le codage étant ma passion, l'apprendre était quelque chose que je voulais faire. J'ai choisi de m'éduquer sur quelque chose qui m'intéressait vraiment. Cela a été un déclencheur pour moi dans la vie et c'est à ce moment-là que je suis tombé amoureux du codage, mais surtout de l'apprentissage.",
  "website": "lien du projet",
  "code": "lien du code",
  "months": "mois",
  "created": "créé par",
  "copied": "copié",
  "learn_more": "en apprendre plus",
  "chal": "défis",
  "suc": "réussites",
  "learning": "apprentissage",
  "header_text1": "Ce projet me vient du site Frontend Mentor. Le but est de créer un site qui gère les factures d’achat des utilisateurs. J’ai donc décidé de coder moi-même ce projet en utilisant React pour le front end et NodeJS pour le back end.",
  "header_text2": "Ce projet me vient de Benjamin Code qui a lancé un challenge, reproduire une partie de la landing page en 1 heure. J’ai décidé de réaliser ce défi, cela m’a pris 2 heures afin d’obtenir un résultat qui me convenait. Ensuite les autres parties de la page m’intéressaient, j’ai donc décidé de cloner la page entière. Le site original que j’ai recréé est Skillex que j'ai trouvé sur Dribble.",
  "header_text3": "Ce projet me vient du site Frontend Mentor. Le but est de créer un site qui gère les commentaires des utilisateurs. J’ai donc décidé de coder moi-même ce projet en utilisant JavaScript pour le front end et NodeJS pour le back end.",
  "p1_ch1": "Connecter le front et le back en utilisant React.",
  "p1_ch2": "Créer une authentification en back end et la gérer en front.",
  "p1_ch3": "Créer des routes privées en front end pour que les utilisateurs non identifiés n’aient pas accès aux pages des factures d’achat.",
  "p1_ch4": "Gérer un formulaire avec de nombreuses informations. Réussir à le stocker, l’envoyer à un serveur et en recevoir un.",
  "p1_ch5": "Créer un CRUD pour les factures d’achat spécifiques à l’utilisateur.",
  "p2_ch1": "Créer l’effet de hover entre les 3 différentes images.",
  "p2_ch2": "Créer les différentes animations lors du scroll et reveal.",
  "p2_ch3": "Recréer au mieux le projet.",
  "p2_ch4": "Créer un smooth scroll entre les différentes sections de la page grâce aux différents liens.",
  "p3_ch1": "Gérer la création d’un commentaire d’utilisateur.",
  "p3_ch2": "Gérer la réception de tous les commentaires.",
  "p3_ch3": "Gérer la modification d’un commentaire.",
  "p3_ch4": "Gérer la suppression d’un commentaire.",
  "p3_ch5": "Réussir à filtrer les commentaires.",
  "p3_ch6": "Réussir à avoir un seul commentaire."
}
