{
  "welcome_to_react": "Welcome to React and react-i18next",
  "dev": "front end developer",
  "intro": "intro",
  "about": "about",
  "projects": "projects",
  "skills": "skills",
  "contact": "contact",
  "me": "me",
  "about_text": "I am a 23 years old self-taught front end developer. I trained for one year in front end development. I acquired solid knowledge thanks to the different apprenticeships available on FreeCodeCamp and Udemy. I was able to learn various languages such as JavaScript and HTML/CSS, but also their frameworks such as React, React Native, Next.js and Sass.",
  "website": "project's link",
  "code": "code's link",
  "months": "months",
  "created": "created by",
  "copied": "copied",
  "learn_more": "learn more",
  "back": "back home",
  "chal": "challenges",
  "suc": "success",
  "learning": "learning",
  "header_text1": "This project comes from the Frontend Mentor site. The goal is to create a site that manages users' purchase invoices. So I decided to code this project myself using React for the front end and NodeJS for the back end.",
  "header_text2": "This project comes from Benjamin Code who launched a challenge, reproduce a part of the landing page in 1 hour. I decided to realize this challenge, it took me 2 hours to get a result that I liked. Then the other parts of the page interested me, so I decided to clone the whole page. The original site I recreated is Skillex that I found on Dribble.",
  "header_text3": "This project comes from the Frontend Mentor site. The goal is to create a site that manages user comments. So I decided to code this project myself using JavaScript for the front end and NodeJS for the back end.",
  "p1_ch1": "Connect the front and the back using React.",
  "p1_ch2": "Create an authentication in back end and manage it in front.",
  "p1_ch3": "Create private routes in the front end so that unidentified users do not have access to the purchase invoice pages.",
  "p1_ch4": "Manage a form with a lot of information. Successfully store it, send it to a server and receive one.",
  "p1_ch5": "Create a CRUD for user-specific purchase invoices.",
  "p2_ch1": "Create the hover effect between the 3 different images.",
  "p2_ch2": "Create the different animations during the scroll and reveal.",
  "p2_ch3": "Create a smooth scroll between the different sections of the page thanks to the different links.",
  "p2_ch4": "Recreate the project as best as possible.",
  "p3_ch1": "Manage the creation of a user comment.",
  "p3_ch2": "Manage the receipt of all comments.",
  "p3_ch3": "Manage the modification of a comment.",
  "p3_ch4": "Manage the deletion of a comment.",
  "p3_ch5": "Successfully filtering comments.",
  "p3_ch6": "Succeed in having only one comment.",
  "p1_su1": "The front and back connection was simple, I took a udemy MERN course which helped me a lot. By using the proxy and launching the server and the front I was able to connect the two.",
  "p1_su2": "The authentication in back I used jsonwebtoken and bcrypt.js to authenticate a user (login, register, logout). On the frontend when the user registered or created an account I stored his token and his name in the reducer and in the LocalStorage. So I could retrieve it when he wanted to access different CRUD methods.",
  "p1_su3": "Creating private routes was a challenge at first. Then, thanks to the Udemy course, I learned how to properly use react-router-dom to set up private routes.",
  "p1_su4": "Managing the form was time consuming. Thanks to Redux, I was able to manage the creation, sending and modification of each input of the form.",
  "p1_su5": "To create a form, I used the POST method",
  "p1_su6": "To receive the forms, I used the GET method.",
  "p1_su7": "For the modification of a form, I used the PATCH method.",
  "p1_su8": "To delete a form, I used the DELETE method.",
  "p2_su1": "In order to achieve the hover effect between the 3 different images I simply used flex. The 3 images are flexed together and the image that is hovered gets a bigger flex than the two others.",
  "p2_su2": "To create the different animations during the scroll I used the gsap package which greatly facilitates the animation effects.",
  "p2_su3": "To realize the scroll between the different sections, I used the Context API of React. I created this function that I used on my links thanks to OnClick.",
  "p2_su4": "To recreate the project, I used the Inspector tool in my browser.",
  "p3_su1": "For the creation of a comment, I used the POST method.",
  "p3_su2": "To receive all the comments, I used the GET method.",
  "p3_su3": "For the modification of a comment, I used the PATCH method.",
  "p3_su4": "To delete a comment, I used the DELETE method.",
  "p3_su5": "To filter the comments, I decided to use the back rather than the front for clarity and lightness.",
  "p3_su6": "To succeed in displaying only one comment, I used its id which I pass in the url and which I recover then.",
  "learn-1": "During the creation of this project, I learned to create a MERN application, combining my front end (React) and back end (NodeJS, Express, MongoDB) knowledge. I now know how to authenticate a user and create private routes. Thanks to this project, I solidified my knowledge in React and NodeJS.",
  "learn-2": "While creating this project, I learned how to recreate a landing page and make it more responsive. I now know how to use gsap to create on reveal and on scroll animations. Thanks to this project, I solidified my knowledge of React, Styled Components and learned how to use gsap.",
  "learn-3": "During the creation of this project, I learned to create a full stack application, combining my front end (Javascript) and back end (NodeJS, Express, MongoDB) knowledge. I now know how to connect my page (front end) with my server (back end). Thanks to this project, I solidified my knowledge in JavaScript and NodeJS.",
  "experience1": "My missions were to improve and develop new features for the existing applications. Working mainly on the company's website (React) and on the mobile application (React Native). But also to develop a new project, a marketplace (Next.js).."
}
